In [1]:
import pandas as pd
city=pd.Series([12,-3,8,-6])
city

0    12
1    -3
2     8
3    -6
dtype: int64

In [2]:
city.values

array([12, -3,  8, -6])

In [3]:
city.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
city.dtype

dtype('int64')

In [5]:
city=pd.Series([12,-3,8,-6],index=['day1','day2','day3','day4'])
city

day1    12
day2    -3
day3     8
day4    -6
dtype: int64

In [6]:
city['day2']

-3

In [7]:
city[['day1','day3']]

day1    12
day3     8
dtype: int64

In [8]:
city[city>0]

day1    12
day3     8
dtype: int64

In [9]:
city.min()

-6

In [10]:
city.max()

12

In [11]:
city[(city>2)&(city<9)]

day3    8
dtype: int64

In [12]:
city+3

day1    15
day2     0
day3    11
day4    -3
dtype: int64

In [13]:
city-3

day1    9
day2   -6
day3    5
day4   -9
dtype: int64

In [14]:
city*3

day1    36
day2    -9
day3    24
day4   -18
dtype: int64

In [15]:
city/3

day1    4.000000
day2   -1.000000
day3    2.666667
day4   -2.000000
dtype: float64

In [16]:
#creat series using dictionary
data={'KL':28,"KA":32,'TN':35,'DL':38}
data1=pd.Series(data)
data1

KL    28
KA    32
TN    35
DL    38
dtype: int64

In [17]:
states=['DL','KL','KA','TN','MP']
city=pd.Series(data,index=states)
city

DL    38.0
KL    28.0
KA    32.0
TN    35.0
MP     NaN
dtype: float64

In [18]:
city.isna()

DL    False
KL    False
KA    False
TN    False
MP     True
dtype: bool

In [19]:
city.notna()

DL     True
KL     True
KA     True
TN     True
MP    False
dtype: bool

# PANDA DATAFRAME

In [20]:
import pandas as pd
pop_data={'year':[2000,2001,2002,2003,2004],'States':['KERALA','DELHI','NAGPUR','HARYANA','PANJAB'],'Population':[300,400,250,520,350]}
pop_data=pd.DataFrame(pop_data,columns=['year','States','Population'])
pop_data

   year   States  Population
0  2000   KERALA         300
1  2001    DELHI         400
2  2002   NAGPUR         250
3  2003  HARYANA         520
4  2004   PANJAB         350

In [21]:
pop_data=pd.DataFrame(pop_data,columns=['year','States','Population','income'])
pop_data

   year   States  Population  income
0  2000   KERALA         300     NaN
1  2001    DELHI         400     NaN
2  2002   NAGPUR         250     NaN
3  2003  HARYANA         520     NaN
4  2004   PANJAB         350     NaN

In [22]:
pop_data['Population']

0    300
1    400
2    250
3    520
4    350
Name: Population, dtype: int64

In [23]:
pop_data['income']=[20000,30000,52000,34000,27000]
pop_data

   year   States  Population  income
0  2000   KERALA         300   20000
1  2001    DELHI         400   30000
2  2002   NAGPUR         250   52000
3  2003  HARYANA         520   34000
4  2004   PANJAB         350   27000

In [24]:
pop_data['debt']=[15000,3200,4000,6000,7500]
pop_data

   year   States  Population  income   debt
0  2000   KERALA         300   20000  15000
1  2001    DELHI         400   30000   3200
2  2002   NAGPUR         250   52000   4000
3  2003  HARYANA         520   34000   6000
4  2004   PANJAB         350   27000   7500

In [25]:
pop_data['savings']=pop_data['income']-pop_data['debt']
pop_data

   year   States  Population  income   debt  savings
0  2000   KERALA         300   20000  15000     5000
1  2001    DELHI         400   30000   3200    26800
2  2002   NAGPUR         250   52000   4000    48000
3  2003  HARYANA         520   34000   6000    28000
4  2004   PANJAB         350   27000   7500    19500

# method1 delete a column

In [26]:
pop_data1=pop_data.drop('Population',axis=1)
pop_data1

   year   States  income   debt  savings
0  2000   KERALA   20000  15000     5000
1  2001    DELHI   30000   3200    26800
2  2002   NAGPUR   52000   4000    48000
3  2003  HARYANA   34000   6000    28000
4  2004   PANJAB   27000   7500    19500

# method2 delete a column

In [27]:
del pop_data['Population']
pop_data

   year   States  income   debt  savings
0  2000   KERALA   20000  15000     5000
1  2001    DELHI   30000   3200    26800
2  2002   NAGPUR   52000   4000    48000
3  2003  HARYANA   34000   6000    28000
4  2004   PANJAB   27000   7500    19500

In [28]:
del pop_data['savings']
pop_data

   year   States  income   debt
0  2000   KERALA   20000  15000
1  2001    DELHI   30000   3200
2  2002   NAGPUR   52000   4000
3  2003  HARYANA   34000   6000
4  2004   PANJAB   27000   7500

In [29]:
pop_data.ndim

2

In [30]:
pop_data.size

20

In [2]:
import pandas as pd
S1 = pd.Series(data = range(31, 2, -6), index = [x for x in "aeiou"])
print(S1)

a    31
e    25
i    19
o    13
u     7
dtype: int64

In [3]:
import numpy as np 
arr = np.array([5,6,7,8,9,10], ndmin = 2)
print (arr)

[[ 5  6  7  8  9 10]]